#pragma once

#include <stddef.h>
#include <stdint.h>
#include <types.h>

/* ========================================================================= */
/* 1. Типы и Перечисления                                                   */
/* ========================================================================= */

// Тип узла: пока берем только 2 базовых типа для тестов
typedef enum VNodeType {
  VNodeRegular,  // Обычный файл
  VNodeDirectory // Директория
} VNodeType;

struct VNode;

/* ========================================================================= */
/* 2. Минимальная Таблица Методов (VTable)                                  */
/* ========================================================================= */

typedef struct VNodeOps {
  // Вызывается, когда VNode окончательно уничтожается (RefCount == 0),
  // чтобы конкретная ФС могла очистить свое InternalData
  void (*Destroy)(struct VNode *node);
} VNodeOps;

/* ========================================================================= */
/* 3. Минимальная Структура Узла                                            */
/* ========================================================================= */

typedef struct VNode {
  VNodeType Type; // Тип узла
  u64 Size;       // Размер в байтах (для файлов)
  u32 RefCount;   // Счетчик ссылок на объект

  VNodeOps *Ops;      // Указатель на методы (может быть NULL)
  void *InternalData; // Данные конкретной ФС (может быть NULL)
} VNode;

/* ========================================================================= */
/* 4. Объявления Функций (Фабрика Узлов)                                    */
/* ========================================================================= */

// Создает новый VNode в куче ядра (через TLSF)
VNode *VfsAllocNode(VNodeType type);

// Увеличивает счетчик ссылок (защита от случайного удаления)
void VfsRefNode(VNode *node);

// Уменьшает счетчик ссылок. Если RefCount == 0 — освобождает память
void VfsUnrefNode(VNode *node);
